<style  type="text/css"> 
cool {
  width: 100px;
  height: 100px;
  background-color: red;
  position: relative;
  -webkit-animation-name: example; /* Safari 4.0 - 8.0 */
  -webkit-animation-duration: 4s; /* Safari 4.0 - 8.0 */
  -webkit-animation-iteration-count: infinite; /* Safari 4.0 - 8.0 */
  animation-name: example;
  animation-duration: 4s;
  animation-iteration-count: infinite;
}

/* Safari 4.0 - 8.0 */
@-webkit-keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}

/* Standard syntax */
@keyframes example {
  0%   {background-color:red; left:0px; top:0px;}
  25%  {background-color:yellow; left:200px; top:0px;}
  50%  {background-color:blue; left:200px; top:200px;}
  75%  {background-color:green; left:0px; top:200px;}
  100% {background-color:red; left:0px; top:0px;}
}
</style>

<b><center>
<span style="font-size: 24pt; line-height: 1.2">
COMS W4111: Introduction to Databases<br>
Spring 2023, Sections 002
</span>
</center></b>
<br>
<p>
<i><center>
<span style="font-size: 20pt; line-height: 1.2">
Homework 1, Part 2<br>Introduction to Core Concepts, ER Modeling, Relational Algebra, SQL<br>
    
</span>
</center></i>

# Introduction and Overview

## HW Objectives

- HW 1 part 1 covered general topics and knowledge from the class material. Part 2 has practical exercises.


- The notebook contains core practical exercises for both tracks (Programming, Non-Programming). All students complete this section.


- There are not track specific assignments for this HW.

## Submission Instructions

Complete all the tests in this notebook and submit only this notebook as a PDF to GradeScope. To convert the jupyter notebook into a pdf you can use either of the following methods:

- File --> Print Preview --> Print --> Save to PDF 

- File --> Download As HTML --> Print --> Save to PDF


__Due date: February 12, 11:59 PM EDT on GradeScope__



It is recommended that you put the screenshots into the same folder as this notebook so you do not have to alter the path to include your images. 


Please read all the instructions thoroughly!

## Guidelines

You may not work with or collaborate with anyone in any way to complete the homework. You may speak with the professor and TAs. You may ask __private__ questions on Ed if you need clarification.


You may use lecture slides, the textbook slides, the textbook or public information on the web to help you answer your questions. You may not "cut and past" information. Your answer must be in your own words and demonstrate the you understand the concept. If you use information for sources other than lectures, lecture slides, textbook slides or the textbook, you MUST provide a URL to the source you used.

## Add Student Information

1. Replace my name with your full name.
2. Replace my UNI with your UNI.
3. Replace "Cool Track" with either "Programming" or "Non-programming."

In [1]:
# Print your name, uni, and track below

name = "Ziggy Chen"
uni = "xc2605"
track = "Programming Track"

print(name)
print(uni)
print(track)

Ziggy Chen
xc2605
Programming Track

# Testing Environment

Run the following cells to ensure that your environment is set up.


You may need to change passwords.

## General Packages

In [2]:
import json

In [3]:
import csv

In [4]:
import pandas

In [5]:
import os

## pymysql

In [6]:
import pymysql

In [7]:
#
# Run this cell but change your user ID and password.
#
pymysql_conn = pymysql.connect(
    user="root",
    password="dbuserdbuser",
    host="localhost",
    port=3306,
    autocommit=True,
    cursorclass=pymysql.cursors.DictCursor
)

In [8]:
cursor = pymysql_conn.cursor()
sql = "show databases"
res = cursor.execute(sql)
databases = cursor.fetchall()

In [9]:
#
# Your list of databases will be different.
# You are fine as long as you do not get an error.
#
databases

[{'Database': 'db_book'},
 {'Database': 'information_schema'},
 {'Database': 'lahmanshw1'},
 {'Database': 'mysql'},
 {'Database': 'performance_schema'},
 {'Database': 'sys'},
 {'Database': 'W4111_HW1'}]

## ipython-SQL

In [10]:
%load_ext sql

In [11]:
#
# Remember to change your user ID and password.
#
%sql mysql+pymysql://root:dbuserdbuser@localhost

In [12]:
%sql select * from db_book.student where ID=12345

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('12345', 'Shankar', 'Comp. Sci.', Decimal('32'))]

## SQLAlchemy

In [13]:
from sqlalchemy import create_engine

In [14]:
#
# Remember to change your user ID and password.
#
sql_url = "mysql+pymysql://root:dbuserdbuser@localhost"

In [15]:
engine = create_engine(sql_url)

In [16]:
sql = "select * from db_book.student"
df = pandas.read_sql(sql, con=engine)

In [17]:
df

       ID      name   dept_name  tot_cred
0   00128     Zhang  Comp. Sci.     102.0
1   12345   Shankar  Comp. Sci.      32.0
2   19991    Brandt     History      80.0
3   23121    Chavez     Finance     110.0
4   44553   Peltier     Physics      56.0
5   45678      Levy     Physics      46.0
6   54321  Williams  Comp. Sci.      54.0
7   55739   Sanchez       Music      38.0
8   70557      Snow     Physics       0.0
9   76543     Brown  Comp. Sci.      58.0
10  76653       Aoi  Elec. Eng.      60.0
11  98765  Bourikas  Elec. Eng.      98.0
12  98988    Tanaka     Biology     120.0

# Common Exercises

## Loading Data

- If you are running the notebook in the folder that you cloned/downloaded, there are files in the ```data``` directory.

In [18]:
!ls data

Appearances.csv                       course_feed.json
Batting.csv                           course_info.json
Managers.csv                          departments.csv
People.csv                            evalkit_eval_courses_instructors.json
Pitching.csv                          evalkit_eval_instructors.json
Teams.csv                             instructors.json
characters-groups.csv                 scenes.csv
characters.csv                        tmp.py

In [19]:
data_dir = "data/"
csv_files = [
    "People.csv",
    "Appearances.csv",
    "Batting.csv",
    "Pitching.csv",
    "Teams.csv",
    "Managers.csv"
]

- Use ```%sql``` to create a databases schema ```lahmanshw1```.

In [20]:
#
# Answer
#
%sql DROP SCHEMA lahmanshw1 # Always drop before create

%sql CREATE SCHEMA lahmanshw1 #re-create the schema

 * mysql+pymysql://root:***@localhost
6 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

- The class lecture showed how to load a CSV file in Pandas and save to a database.


- Load and save the CSV files. You should implement the function and then call in the following cells.

In [21]:
def load_and_save_csv(data_dir:str, file_name:str, schema:str, table_name:str=None):
    """
    
    :param data_dir: The directory containing the file.
    :param file_name: The file name.
    :param schema: The database for the saved table.
    :param table_name: The name of the table to create. If the name is None, the function uses the name of
        the file before '.csv'. So, file_name 'cat.csv' becomes table 'cat'.
    :return: None
    """
    
    if table_name is None:
        table_name = file_name.split(".")
        table_name = table_name[0]
        
    full_file_name = os.path.join(data_dir, file_name)
    
    #
    # TODO: Remove answer and have your code goes here. 
    # Nothing wrong so we do not modify anything
    df = pandas.read_csv(full_file_name)
    df.to_sql(table_name, con=engine, schema=schema, if_exists='replace', index=False)

In [22]:
for f in csv_files:
    load_and_save_csv(data_dir, f, "lahmanshw1")
    print("Saved file:", f)

Saved file: People.csv
Saved file: Appearances.csv
Saved file: Batting.csv
Saved file: Pitching.csv
Saved file: Teams.csv
Saved file: Managers.csv

In [23]:
#
# The following should get the create table statements for the tables
# you created above.
#
# This code is here just because I was bored.
#
tables = %sql show tables from lahmanshw1
table_names = [t[0] for t in tables]
table_names

all_tables = ""

%sql use lahmanshw1

for t in table_names:
    sql = "show create table " + t
    tmp = %sql $sql 
    tmp = tmp[0][1]
    all_tables += "\n\n" + tmp

 * mysql+pymysql://root:***@localhost
6 rows affected.
 * mysql+pymysql://root:***@localhost
0 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.
 * mysql+pymysql://root:***@localhost
1 rows affected.

In [24]:
#
# If you want to see the schema printed as text, just uncomment the following and run.
#
# print(all_tables)

## Schema and Data Cleanup

- There is a section below for each of the tables you created/loaded. 


- There is a set of instructions in each section.


- You are going to "clean up" the tables, primarily focusing on keys.


- A conceptual ER diagram for the schema is:

| <img src="./lahmans-conceptual.png" width="700px"> |
| :---: |
| __Conceptual ER Diagram__ |

### People

- The ```people``` table scheme is below.

```
create table People
(
    playerID     text   null,
    birthYear    double null,
    birthMonth   double null,
    birthDay     double null,
    birthCountry text   null,
    birthState   text   null,
    birthCity    text   null,
    deathYear    double null,
    deathMonth   double null,
    deathDay     double null,
    deathCountry text   null,
    deathState   text   null,
    deathCity    text   null,
    nameFirst    text   null,
    nameLast     text   null,
    nameGiven    text   null,
    weight       double null,
    height       double null,
    bats         text   null,
    throws       text   null,
    debut        text   null,
    finalGame    text   null,
    retroID      text   null,
    bbrefID      text   null
);
```

- You are to implement the following tasks:
    1. Determine reasonable lengths for ```text``` columns and convert the columns to ```varchar```.
    3. Convert the columns that are ```double``` to ```int```.
    2. Add columns ```dateOfBirth``` and ```dateOfDeath``` of type ```Date```. Set the values of the new columns based on the ```birthYear, birthMonth, birthDay, deathYear, deathMonth, deathDay``` column values.
    4. Change ```bats``` and ```throws``` to ```ENUM``` types.
    5. Convert the column type for ```debug``` and ```finalGame``` to date and set the values correctly.
    
    
- You implement the tasks changing the schema by executing ```ALTER TABLE``` statements.


- Changing or setting values usually requires you to execute ```UPDATE``` statements.


- You need to execute you statements in the cells below. You may add additional cells.

In [25]:
# In the following five cells, we check the max(length) of each text attributes

%sql SELECT max(LENGTH(playerID)), max(LENGTH(birthCountry)), max(LENGTH(birthState)) FROM People

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(9, 14, 22)]

In [26]:
%sql SELECT max(LENGTH(deathCity)), max(LENGTH(nameFirst)), max(LENGTH(nameLast)) FROM People

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(26, 14, 14)]

In [27]:
%sql SELECT max(LENGTH(nameGiven)), max(LENGTH(bats)), max(LENGTH(throws)) FROM People

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(43, 1, 1)]

In [28]:
%sql SELECT max(LENGTH(debut)), max(LENGTH(finalGame)), max(LENGTH(retroID)), max(LENGTH(bbrefID)) FROM People

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(10, 10, 8, 9)]

In [29]:
%%sql
# we MODIFY them to varchar with a length of double the value of its nearest binary values (but no more than 512)
ALTER TABLE People MODIFY playerID varchar(16);
ALTER TABLE People MODIFY birthCountry varchar(32);
ALTER TABLE People MODIFY birthState varchar(64);
ALTER TABLE People MODIFY birthCity varchar(64);
ALTER TABLE People MODIFY deathCountry varchar(32);
ALTER TABLE People MODIFY deathState varchar(64);
ALTER TABLE People MODIFY deathCity varchar(64);
ALTER TABLE People MODIFY nameFirst varchar(32);
ALTER TABLE People MODIFY nameLast varchar(32);
ALTER TABLE People MODIFY nameGiven varchar(64);
ALTER TABLE People MODIFY bats varchar(2);
ALTER TABLE People MODIFY throws varchar(2);
ALTER TABLE People MODIFY debut varchar(32);
ALTER TABLE People MODIFY finalGame varchar(32);
ALTER TABLE People MODIFY retroID varchar(16);
ALTER TABLE People MODIFY bbrefID varchar(16);

 * mysql+pymysql://root:***@localhost
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.

[]

In [30]:
%%sql

# alter all double to int (eigth attributes in total)
ALTER TABLE People MODIFY birthYear int;
ALTER TABLE People MODIFY birthMonth int;
ALTER TABLE People MODIFY birthDay int;
ALTER TABLE People MODIFY deathYear int;
ALTER TABLE People MODIFY deathMonth int;
ALTER TABLE People MODIFY deathDay int;
ALTER TABLE People MODIFY weight int;
ALTER TABLE People MODIFY height int;

 * mysql+pymysql://root:***@localhost
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.
20370 rows affected.

[]

In [31]:
%%sql

# add DOB
ALTER TABLE People ADD COLUMN dateOfBirth date;
UPDATE People
SET dateOfBirth=STR_TO_DATE(CONCAT(birthYear, '-', birthMonth, '-', birthDay), "%Y-%c-%e")

 * mysql+pymysql://root:***@localhost
0 rows affected.
20370 rows affected.

[]

In [32]:
%%sql

# add DOD
ALTER TABLE People ADD COLUMN dateOfDeath date;
UPDATE People
SET dateOfDeath=STR_TO_DATE(CONCAT(deathYear, '-', deathMonth, '-', deathDay), "%Y-%c-%e")

 * mysql+pymysql://root:***@localhost
0 rows affected.
20370 rows affected.

[]

In [33]:
%%sql 

## check some sample DOB and DOD
SELECT PlayerID, birthYear, birthMonth, birthDay, dateofBirth, deathYear, deathMonth, deathDay, dateofDeath
FROM People
WHERE birthYear='1939'
limit 12;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('aaronto01', 1939, 8, 5, datetime.date(1939, 8, 5), 1984, 8, 16, datetime.date(1984, 8, 16)),
 ('allenbe01', 1939, 4, 16, datetime.date(1939, 4, 16), None, None, None, None),
 ('azcuejo01', 1939, 8, 18, datetime.date(1939, 8, 18), None, None, None, None),
 ('bassno01', 1939, 1, 21, datetime.date(1939, 1, 21), None, None, None, None),
 ('beaucji01', 1939, 8, 21, datetime.date(1939, 8, 21), 2007, 12, 25, datetime.date(2007, 12, 25)),
 ('bennede01', 1939, 10, 5, datetime.date(1939, 10, 5), 2012, 3, 24, datetime.date(2012, 3, 24)),
 ('bolinbo01', 1939, 1, 29, datetime.date(1939, 1, 29), None, None, None, None),
 ('bouldca01', 1939, 9, 17, datetime.date(1939, 9, 17), None, None, None, None),
 ('boutoji01', 1939, 3, 8, datetime.date(1939, 3, 8), 2019, 7, 10, datetime.date(2019, 7, 10)),
 ('brancha01', 1939, 2, 8, datetime.date(1939, 2, 8), None, None, None, None),
 ('braunjo01', 1939, 12, 26, datetime.date(1939, 12, 26), 2011, 6, 10, datetime.date(2011, 6, 10)),
 ('brocklo01', 1939, 6, 18, datetime.date(1939, 6, 18), 2020, 9, 6, datetime.date(2020, 9, 6))]

In [34]:
# check bats

%sql SELECT DISTINCT bats FROM People;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('R',), ('L',), (None,), ('B',)]

In [35]:
# check throws

%sql SELECT DISTINCT throws FROM People;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('R',), ('L',), (None,), ('S',)]

In [36]:
%%sql
# ALTER TABLE

ALTER TABLE People
MODIFY COLUMN bats ENUM('R', 'L', 'B');
ALTER TABLE People
MODIFY COLUMN throws ENUM('R', 'L', 'S');

 * mysql+pymysql://root:***@localhost
20370 rows affected.
20370 rows affected.

[]

In [37]:
# check bats

%sql SELECT DISTINCT bats FROM People;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('R',), ('L',), (None,), ('B',)]

In [38]:
# check throws

%sql SELECT DISTINCT throws FROM People;

 * mysql+pymysql://root:***@localhost
4 rows affected.

[('R',), ('L',), (None,), ('S',)]

In [39]:
%%sql

ALTER TABLE People MODIFY COLUMN debut date; 
ALTER TABLE People MODIFY COLUMN finalGame date;

 * mysql+pymysql://root:***@localhost
20370 rows affected.
20370 rows affected.

[]

In [40]:
%%sql 

## check some sample debut AND finalGame
SELECT PlayerID, debut, finalGame
FROM People
limit 12;

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('aardsda01', datetime.date(2004, 4, 6), datetime.date(2015, 8, 23)),
 ('aaronha01', datetime.date(1954, 4, 13), datetime.date(1976, 10, 3)),
 ('aaronto01', datetime.date(1962, 4, 10), datetime.date(1971, 9, 26)),
 ('aasedo01', datetime.date(1977, 7, 26), datetime.date(1990, 10, 3)),
 ('abadan01', datetime.date(2001, 9, 10), datetime.date(2006, 4, 13)),
 ('abadfe01', datetime.date(2010, 7, 28), datetime.date(2021, 10, 1)),
 ('abadijo01', datetime.date(1875, 4, 26), datetime.date(1875, 6, 10)),
 ('abbated01', datetime.date(1897, 9, 4), datetime.date(1910, 9, 15)),
 ('abbeybe01', datetime.date(1892, 6, 14), datetime.date(1896, 9, 23)),
 ('abbeych01', datetime.date(1893, 8, 16), datetime.date(1897, 8, 19)),
 ('abbotco01', datetime.date(2021, 6, 5), datetime.date(2021, 10, 2)),
 ('abbotda01', datetime.date(1890, 4, 19), datetime.date(1890, 5, 23))]

### Managers

- The schema for the managers table is

```
create table Managers
(
    playerID text   null,
    yearID   bigint null,
    teamID   text   null,
    lgID     text   null,
    inseason bigint null,
    G        bigint null,
    W        bigint null,
    L        bigint null,
    `rank`   bigint null,
    plyrMgr  text   null
);
```

- You are to implement the following tasks:
    - Convert ```playerID, teamID, lgID``` to ```varchar``` with reasonable sizes.
    - Convert ```yearID``` to ```char(4)```. I will explain why we are not using the data type ```Year```.
    - Convert ```plyrMgr``` to a ```BOOLEAN```. 
    
    
- Some of the tasks may require both ```ALTER TABLE``` and ```UPDATE```.

In [41]:
%sql SELECT max(LENGTH(playerID)), max(LENGTH(teamID)), max(LENGTH(lgID)) FROM Managers

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(9, 3, 2)]

In [42]:
%%sql
# MODIFY to reasonable sizes
# we used the similar processes as that we have done in the previous section
ALTER TABLE Managers MODIFY COLUMN playerID varchar(16);
ALTER TABLE Managers MODIFY COLUMN teamID varchar(8);
ALTER TABLE Managers MODIFY COLUMN lgID varchar(8);

# MODIFY yearID to char(4)
ALTER TABLE Managers MODIFY COLUMN yearID char(4);

 * mysql+pymysql://root:***@localhost
3684 rows affected.
3684 rows affected.
3684 rows affected.
3684 rows affected.

[]

In [43]:
%%sql
# set to 1 and 0
UPDATE Managers 
set plyrMgr = CASE
WHEN plyrMgr = 'Y' THEN 1
WHEN plyrMgr = 'N' THEN 0 ELSE plyrMgr
END;
# convert to boolean
ALTER TABLE Managers MODIFY COLUMN plyrMgr boolean; # note boolean not BOOLEAN

 * mysql+pymysql://root:***@localhost
3684 rows affected.
3684 rows affected.

[]

In [44]:
# check results for some TRUE rows

%sql SELECT playerID, plyrMgr FROM Managers WHERE plyrMgr=TRUE limit 12

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('wrighha01', 1),
 ('woodji01', 1),
 ('paborch01', 1),
 ('lennobi01', 1),
 ('deaneha01', 1),
 ('fergubo01', 1),
 ('mcbridi01', 1),
 ('hastisc01', 1),
 ('pikeli01', 1),
 ('cravebi01', 1),
 ('cravebi01', 1),
 ('millsev01', 1)]

### Appearances

- The schema for the appearances table is

```
create table Appearances
(
    yearID    bigint null,
    teamID    text   null,
    lgID      text   null,
    playerID  text   null,
    G_all     bigint null,
    GS        double null,
    G_batting bigint null,
    G_defense double null,
    G_p       bigint null,
    G_c       bigint null,
    G_1b      bigint null,
    G_2b      bigint null,
    G_3b      bigint null,
    G_ss      bigint null,
    G_lf      bigint null,
    G_cf      bigint null,
    G_rf      bigint null,
    G_of      bigint null,
    G_dh      double null,
    G_ph      double null,
    G_pr      double null
);
```

- Do not worry about the columns that are numeric (```double, bigint```).


- Tasks:
    - Convert ```yearID``` to ```char(4)```
    - Convert the ```text``` columns to reasonably sized ```varchar```.

In [45]:
# convert yearID to char(4)

%sql ALTER TABLE Appearances MODIFY COLUMN yearID char(4);

 * mysql+pymysql://root:***@localhost
110423 rows affected.

[]

In [46]:
%sql SELECT max(LENGTH(playerID)), max(LENGTH(teamID)), max(LENGTH(lgID)) FROM Appearances

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(9, 3, 2)]

In [47]:
%%sql
# convert to reasonable size
ALTER TABLE Appearances MODIFY COLUMN playerID varchar(16);
ALTER TABLE Appearances MODIFY COLUMN teamID varchar(8);
ALTER TABLE Appearances MODIFY COLUMN lgID varchar(8);

 * mysql+pymysql://root:***@localhost
110423 rows affected.
110423 rows affected.
110423 rows affected.

[]

### Batting

- The Batting table is

```
create table Batting
(
    playerID text   null,
    yearID   bigint null,
    stint    bigint null,
    teamID   text   null,
    lgID     text   null,
    G        bigint null,
    AB       bigint null,
    R        bigint null,
    H        bigint null,
    `2B`     bigint null,
    `3B`     bigint null,
    HR       bigint null,
    RBI      double null,
    SB       double null,
    CS       double null,
    BB       bigint null,
    SO       double null,
    IBB      double null,
    HBP      double null,
    SH       double null,
    SF       double null,
    GIDP     double null
);
```

- You only need to fix the definitions ```playerID, teamID, yearID``` and ```lgID```.

In [48]:
%sql SELECT max(LENGTH(playerID)), max(LENGTH(teamID)), max(LENGTH(lgID)) FROM Batting

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(9, 3, 2)]

In [49]:
%%sql
# we need to make everything consistent
ALTER TABLE Batting MODIFY COLUMN yearID char(4); # MODIFY to char(4)

# same as previous definition
ALTER TABLE Batting MODIFY COLUMN playerID varchar(16);
ALTER TABLE Batting MODIFY COLUMN teamID varchar(8);
ALTER TABLE Batting MODIFY COLUMN lgID varchar(8);

 * mysql+pymysql://root:***@localhost
110495 rows affected.
110495 rows affected.
110495 rows affected.
110495 rows affected.

[]

### Pitching

- The Pitching table is:

```
create table Pitching
(
    playerID text   null,
    yearID   bigint null,
    stint    bigint null,
    teamID   text   null,
    lgID     text   null,
    W        bigint null,
    L        bigint null,
    G        bigint null,
    GS       bigint null,
    CG       bigint null,
    SHO      bigint null,
    SV       bigint null,
    IPouts   bigint null,
    H        bigint null,
    ER       bigint null,
    HR       bigint null,
    BB       bigint null,
    SO       bigint null,
    BAOpp    double null,
    ERA      double null,
    IBB      double null,
    WP       bigint null,
    HBP      double null,
    BK       bigint null,
    BFP      double null,
    GF       bigint null,
    R        bigint null,
    SH       double null,
    SF       double null,
    GIDP     double null
);
```

- You only need to fix the definitions ```playerID, teamID, yearID``` and ```lgID```.

In [50]:
%sql SELECT max(LENGTH(playerID)), max(LENGTH(teamID)), max(LENGTH(lgID)) FROM Pitching

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(9, 3, 2)]

In [51]:
%%sql
# we need to make everything consistent
ALTER TABLE Pitching MODIFY COLUMN yearID char(4); # MODIFY to char(4)

# same as previous definition
ALTER TABLE Pitching MODIFY COLUMN playerID varchar(16);
ALTER TABLE Pitching MODIFY COLUMN teamID varchar(8);
ALTER TABLE Pitching MODIFY COLUMN lgID varchar(8);

 * mysql+pymysql://root:***@localhost
49430 rows affected.
49430 rows affected.
49430 rows affected.
49430 rows affected.

[]

### Teams

- The Teams table is:

```
create table Teams
(
    yearID         bigint null,
    lgID           text   null,
    teamID         text   null,
    franchID       text   null,
    divID          text   null,
    `Rank`         bigint null,
    G              bigint null,
    Ghome          double null,
    W              bigint null,
    L              bigint null,
    DivWin         text   null,
    WCWin          text   null,
    LgWin          text   null,
    WSWin          text   null,
    R              bigint null,
    AB             bigint null,
    H              bigint null,
    `2B`           bigint null,
    `3B`           bigint null,
    HR             bigint null,
    BB             double null,
    SO             double null,
    SB             double null,
    CS             double null,
    HBP            double null,
    SF             double null,
    RA             bigint null,
    ER             bigint null,
    ERA            double null,
    CG             bigint null,
    SHO            bigint null,
    SV             bigint null,
    IPouts         bigint null,
    HA             bigint null,
    HRA            bigint null,
    BBA            bigint null,
    SOA            bigint null,
    E              bigint null,
    DP             bigint null,
    FP             double null,
    name           text   null,
    park           text   null,
    attendance     double null,
    BPF            bigint null,
    PPF            bigint null,
    teamIDBR       text   null,
    teamIDlahman45 text   null,
    teamIDretro    text   null
);
```

- You need to make the following changes:
    - Convert ```yearID, teamID, lgID, franchID, divId``` to reasonable types.
    - Convert ```DivWin, WCWin, LGWin, WSWin``` to ```boolean```.

In [52]:
%%sql 
SELECT max(LENGTH(teamID)), max(LENGTH(lgID)), max(LENGTH(franchID)), max(LENGTH(divId))
FROM Teams

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(3, 2, 3, 1)]

In [53]:
%%sql
# make everything consistent
ALTER TABLE Teams MODIFY COLUMN yearID char(4);
ALTER TABLE Teams MODIFY COLUMN teamID varchar(8);
ALTER TABLE Teams MODIFY COLUMN lgID varchar(8);
ALTER TABLE Teams MODIFY COLUMN franchID varchar(8);
ALTER TABLE Teams MODIFY COLUMN divID varchar(4);

 * mysql+pymysql://root:***@localhost
2985 rows affected.
2985 rows affected.
2985 rows affected.
2985 rows affected.
2985 rows affected.

[]

In [54]:
%%sql
# set to 1 and 0
UPDATE Teams 
SET DivWin = CASE
WHEN DivWin = 'Y' THEN 1
WHEN DivWin = 'N' THEN 0 ELSE DivWin
END;

ALTER TABLE Teams MODIFY COLUMN DivWin boolean;

UPDATE Teams 
SET WCWin = CASE
WHEN WCWin = 'Y' THEN 1
WHEN WCWin = 'N' THEN 0 ELSE WCWin
END;

ALTER TABLE Teams MODIFY COLUMN WCWin boolean;

UPDATE Teams 
SET LGWin = CASE
WHEN LGWin = 'Y' THEN 1
WHEN LGWin = 'N' THEN 0 ELSE LGWin
END;

ALTER TABLE Teams MODIFY COLUMN LGWin boolean;

UPDATE Teams 
SET WSWin = CASE
WHEN WSWin = 'Y' THEN 1
WHEN WSWin = 'N' THEN 0 ELSE WSWin
END;

ALTER TABLE Teams MODIFY COLUMN LGWin boolean;

 * mysql+pymysql://root:***@localhost
2985 rows affected.
2985 rows affected.
2985 rows affected.
2985 rows affected.
2985 rows affected.
2985 rows affected.
2985 rows affected.
0 rows affected.

[]

In [55]:
# check results for some TRUE rows

%sql SELECT teamID, DivWin, WCWin, LGWin, WSWin FROM Teams WHERE WCWin=TRUE limit 12

 * mysql+pymysql://root:***@localhost
12 rows affected.

[('COL', 0, 1, 0, '0'),
 ('NYA', 0, 1, 0, '0'),
 ('BAL', 0, 1, 0, '0'),
 ('LAN', 0, 1, 0, '0'),
 ('FLO', 0, 1, 1, '1'),
 ('NYA', 0, 1, 0, '0'),
 ('BOS', 0, 1, 0, '0'),
 ('CHN', 0, 1, 0, '0'),
 ('BOS', 0, 1, 0, '0'),
 ('NYN', 0, 1, 0, '0'),
 ('NYN', 0, 1, 1, '0'),
 ('SEA', 0, 1, 0, '0')]

### Keys

#### Primary Keys

- In the following cells, write and SQL statements that demonstrates the combination of columns that is a valid primary key for each of the 6 tables.

***Check if the distinct pairs of selected key sets have the same number as that of the corresponding table***

**People**

In [56]:
%sql SELECT COUNT(DISTINCT playerID) FROM People;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(20370,)]

In [57]:
%sql SELECT COUNT(*) FROM People; # same as previous one

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(20370,)]

In [58]:
%sql SELECT * FROM People WHERE playerID IS NULL # not null

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

**Managers**

In [59]:
%sql SELECT COUNT(DISTINCT playerID, yearID, inseason) FROM Managers;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(3684,)]

In [60]:
%sql SELECT COUNT(*) FROM Managers; # same as previous one

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(3684,)]

In [61]:
%sql SELECT COUNT(*) FROM Managers WHERE playerID IS NULL OR yearID IS NULL OR inseason IS NULL # not null

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(0,)]

**Appearances**

In [62]:
%sql SELECT COUNT(DISTINCT playerID, teamID, yearID) FROM Appearances;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(110423,)]

In [63]:
%sql SELECT COUNT(*) FROM Appearances; # same number

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(110423,)]

In [64]:
%sql SELECT COUNT(*) FROM Appearances WHERE playerID IS NULL OR teamID IS NULL OR yearID IS NULL # not null

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(0,)]

**Batting**

In [65]:
%sql SELECT COUNT(DISTINCT playerID, yearID, stint) FROM Batting;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(110495,)]

In [66]:
%sql SELECT COUNT(*) FROM Batting; # same number

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(110495,)]

In [67]:
%sql SELECT COUNT(*) FROM Batting WHERE playerID IS NULL OR yearID IS NULL OR stint IS NULL # not null

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(0,)]

**Pitching**

In [68]:
%sql SELECT COUNT(DISTINCT playerID, yearID, stint) FROM Pitching;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(49430,)]

In [69]:
%sql SELECT COUNT(*) FROM Pitching; # same number

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(49430,)]

In [70]:
%sql SELECT COUNT(*) FROM Pitching WHERE playerID IS NULL OR yearID IS NULL OR stint IS NULL # not null

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(0,)]

**Teams**

In [71]:
%sql SELECT COUNT(DISTINCT teamID, yearID) FROM Teams;

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(2985,)]

In [72]:
%sql SELECT COUNT(*) FROM Teams; # same number

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(2985,)]

In [73]:
%sql SELECT COUNT(*) FROM Teams WHERE teamID IS NULL OR yearID IS NULL # not null

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(0,)]

- Write and execute SQL ```ALTER TABLE``` staments to add the primary keys to the tables.

In [74]:
%sql ALTER TABLE People ADD PRIMARY KEY (playerID); # People

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [75]:
%sql ALTER TABLE Managers ADD PRIMARY KEY (playerID, yearID, inseason); # Managers

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [76]:
%sql ALTER TABLE Appearances ADD PRIMARY KEY (playerID, teamID, yearID); # Appearances

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [77]:
%sql ALTER TABLE Batting ADD PRIMARY KEY (playerID, yearID, stint); # Batting

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [78]:
%sql ALTER TABLE Pitching ADD PRIMARY KEY (playerID, yearID, stint); # Pitching

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [79]:
%sql ALTER TABLE Teams ADD PRIMARY KEY (teamID, yearID); # Teams

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

- You will need to write queries that determine which columns form the foreign keys in the relationships. Write and execute your queries below.

***We will have to check if the the chosen FKs are in the refercing tables***

**Appearances**

In [80]:
%%sql
SELECT * 
FROM Appearances
WHERE playerID NOT IN(
    SELECT playerID FROM People
)

 * mysql+pymysql://root:***@localhost
1 rows affected.

[('1875', 'WS6', None, 'thompan01', 11, None, 11, None, 0, 11, 0, 0, 0, 0, 0, 0, 1, 1, 0.0, None, None)]

In [81]:
%%sql
SELECT * 
FROM Appearances
WHERE (teamID, yearID) NOT IN(
    SELECT teamID, yearID FROM Teams
)

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [82]:
%%sql
# clean the data
DELETE
FROM Appearances
WHERE playerID='thompan01' AND teamID='WS6' AND yearID='1875'

 * mysql+pymysql://root:***@localhost
1 rows affected.

[]

In [83]:
%%sql
# data cleaned
SELECT COUNT(*) 
FROM Appearances
WHERE playerID NOT IN(
    SELECT playerID FROM People
)

 * mysql+pymysql://root:***@localhost
1 rows affected.

[(0,)]

**Batting**

In [84]:
%%sql
SELECT * 
FROM Batting
WHERE (playerID, teamID, yearID) NOT IN(
    SELECT playerID, teamID, yearID FROM Appearances
)

 * mysql+pymysql://root:***@localhost
2 rows affected.

[('smithbu01', '1911', 1, 'WS1', 'AL', 1, 0, 0, 0, 0, 0, 0, 0.0, 0.0, None, 0, None, None, 0.0, 0.0, None, None),
 ('thompfr01', '1875', 2, 'WS6', None, 11, 41, 3, 4, 0, 1, 0, 3.0, 0.0, 0.0, 0, 1.0, None, None, None, None, 0.0)]

In [85]:
%%sql
# clean data
DELETE 
FROM Batting
WHERE playerID='smithbu01' AND yearID='1911' AND teamID='WS1';

DELETE 
FROM Batting
WHERE playerID='thompfr01' AND yearID='1875' AND teamID='WS6';

 * mysql+pymysql://root:***@localhost
1 rows affected.
1 rows affected.

[]

In [86]:
%%sql
# all set
SELECT * 
FROM Batting
WHERE (playerID, teamID, yearID) NOT IN(
    SELECT playerID, teamID, yearID FROM Appearances
)

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

**Pitching**

In [87]:
%%sql
SELECT * 
FROM Pitching
WHERE (playerID, teamID, yearID) NOT IN(
    SELECT playerID, teamID, yearID FROM Appearances
)

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

**Managers**

In [88]:
%%sql
SELECT * 
FROM Managers
WHERE playerID NOT IN(
    SELECT playerID FROM People
)

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

In [89]:
%%sql
SELECT * 
FROM Managers
WHERE (teamID, yearID) NOT IN(
    SELECT teamID, yearID FROM Teams
)

 * mysql+pymysql://root:***@localhost
0 rows affected.

[]

- Write and execute the ```ALTER TABLE``` statements to create the foreign keys.


- __NOTE:__ There may be some minor issues with missing or incorrect data. You can delete a few rows if necessary.

***We noticed that People and Teams are two essential tables of the dataset with other tables referencing them***

In [90]:
%%sql
# 1. Appearances
ALTER TABLE Appearances ADD FOREIGN KEY (playerID) REFERENCES People (playerID);
ALTEr TABLE Appearances ADD FOREIGN KEY (teamID, yearID) REFERENCES teams (teamID, yearID);

 * mysql+pymysql://root:***@localhost
110422 rows affected.
110422 rows affected.

[]

In [91]:
%%sql
# 2. Batting
ALTER TABLE Batting ADD FOREIGN KEY (playerID, teamID, yearID) REFERENCES Appearances (playerID, teamID, yearID);

 * mysql+pymysql://root:***@localhost
110493 rows affected.

[]

In [92]:
%%sql
# 3. Pitching
ALTER TABLE Pitching ADD FOREIGN KEY (playerID, teamID, yearID) REFERENCES Appearances (playerID, teamID, yearID);

 * mysql+pymysql://root:***@localhost
49430 rows affected.

[]

In [93]:
%%sql
# 4. Managers
ALTER TABLE Managers ADD FOREIGN KEY (playerID) REFERENCES People (playerID);
ALTEr TABLE Managers ADD FOREIGN KEY (teamID, yearID) REFERENCES teams (teamID, yearID);

 * mysql+pymysql://root:***@localhost
3684 rows affected.
3684 rows affected.

[]

## SQL Queries

### On-Base Percentage and Slugging

- Use the ```Batting``` table and ```People``` table.


- The formula for ```onBasePercentage``` is:
\begin{equation}
\frac{(H - 2b - 3b - HR) + 2 \times 2b + 3 \times 3b + 4 \times HR)}{AB}
\end{equation}


- Write a query that returns a table of the form
```
(playerID, nameLast, nameFirst, h, ab, G, onBasePercentage)
```

- Test your query with ```playerID``` ```willite01```.

In [94]:
%%sql
# return the desired table
SELECT Batting.playerID, nameLast, nameFirst, H AS h, AB AS ab, G, 
    ((H - 2B - 3B - HR) + 2*2B + 3*3B + 4*HR)/(AB) as onBasePercentage 
FROM Batting 
JOIN People
ON Batting.playerID = People.playerID AND AB != 0 
LIMIT 20

 * mysql+pymysql://root:***@localhost
20 rows affected.

[('aardsda01', 'Aardsma', 'David', 0, 2, 45, Decimal('0.0000')),
 ('aardsda01', 'Aardsma', 'David', 0, 1, 47, Decimal('0.0000')),
 ('aardsda01', 'Aardsma', 'David', 0, 1, 33, Decimal('0.0000')),
 ('aaronha01', 'Aaron', 'Hank', 131, 468, 122, Decimal('0.4466')),
 ('aaronha01', 'Aaron', 'Hank', 189, 602, 153, Decimal('0.5399')),
 ('aaronha01', 'Aaron', 'Hank', 200, 609, 153, Decimal('0.5583')),
 ('aaronha01', 'Aaron', 'Hank', 198, 615, 151, Decimal('0.6000')),
 ('aaronha01', 'Aaron', 'Hank', 196, 601, 153, Decimal('0.5458')),
 ('aaronha01', 'Aaron', 'Hank', 223, 629, 154, Decimal('0.6359')),
 ('aaronha01', 'Aaron', 'Hank', 172, 590, 153, Decimal('0.5661')),
 ('aaronha01', 'Aaron', 'Hank', 197, 603, 155, Decimal('0.5937')),
 ('aaronha01', 'Aaron', 'Hank', 191, 592, 156, Decimal('0.6182')),
 ('aaronha01', 'Aaron', 'Hank', 201, 631, 161, Decimal('0.5864')),
 ('aaronha01', 'Aaron', 'Hank', 187, 570, 145, Decimal('0.5140')),
 ('aaronha01', 'Aaron', 'Hank', 181, 570, 150, Decimal('0.5596')),
 ('aaronha01', 'Aaron', 'Hank', 168, 603, 158, Decimal('0.5390')),
 ('aaronha01', 'Aaron', 'Hank', 184, 600, 155, Decimal('0.5733')),
 ('aaronha01', 'Aaron', 'Hank', 174, 606, 160, Decimal('0.4983')),
 ('aaronha01', 'Aaron', 'Hank', 164, 547, 147, Decimal('0.6069')),
 ('aaronha01', 'Aaron', 'Hank', 154, 516, 150, Decimal('0.5736'))]

In [95]:
%%sql
# test with willite01
SELECT Batting.playerID, nameLast, nameFirst, H AS h, AB AS ab, G, 
    ((H - 2B - 3B - HR) + 2*2B + 3*3B + 4*HR)/(AB) as onBasePercentage 
FROM Batting 
JOIN People
ON Batting.playerID = People.playerID AND AB != 0 AND Batting.playerID = 'willite01'

 * mysql+pymysql://root:***@localhost
19 rows affected.

[('willite01', 'Williams', 'Ted', 185, 565, 149, Decimal('0.6088')),
 ('willite01', 'Williams', 'Ted', 193, 561, 144, Decimal('0.5936')),
 ('willite01', 'Williams', 'Ted', 185, 456, 143, Decimal('0.7346')),
 ('willite01', 'Williams', 'Ted', 186, 522, 150, Decimal('0.6475')),
 ('willite01', 'Williams', 'Ted', 176, 514, 150, Decimal('0.6673')),
 ('willite01', 'Williams', 'Ted', 181, 528, 156, Decimal('0.6345')),
 ('willite01', 'Williams', 'Ted', 188, 509, 137, Decimal('0.6149')),
 ('willite01', 'Williams', 'Ted', 194, 566, 155, Decimal('0.6502')),
 ('willite01', 'Williams', 'Ted', 106, 334, 89, Decimal('0.6467')),
 ('willite01', 'Williams', 'Ted', 169, 531, 148, Decimal('0.5556')),
 ('willite01', 'Williams', 'Ted', 4, 10, 6, Decimal('0.9000')),
 ('willite01', 'Williams', 'Ted', 37, 91, 37, Decimal('0.9011')),
 ('willite01', 'Williams', 'Ted', 133, 386, 117, Decimal('0.6347')),
 ('willite01', 'Williams', 'Ted', 114, 320, 98, Decimal('0.7031')),
 ('willite01', 'Williams', 'Ted', 138, 400, 136, Decimal('0.6050')),
 ('willite01', 'Williams', 'Ted', 163, 420, 132, Decimal('0.7310')),
 ('willite01', 'Williams', 'Ted', 135, 411, 129, Decimal('0.5839')),
 ('willite01', 'Williams', 'Ted', 69, 272, 103, Decimal('0.4191')),
 ('willite01', 'Williams', 'Ted', 98, 310, 113, Decimal('0.6452'))]

### Players and Managers

- A person in ```People``` was a "player" if their ```playerID``` appears in ```Appearances.```


- A person in ```People``` was a "manager" if their ```playerID``` appears in ```Managers.```


- Write a query that returns a table of the form
```
(playerID, nameLast, nameFirst, career_player_games, career_manager_games)
```

- ```career_player_games``` is the sum of ```Appearances.G_all```. The value should be ```0``` if the person was never a player.


- ```career_manager_games``` is the sum of ```Managers.G```. The value should be ```0``` if the person was never a manager.


- Test your query with players born in California with ```nameLast``` "Williams."

In [96]:
%%sql
# try the query

SELECT ppl.playerID, ppl.nameLast, ppl.nameFirst,
IFNULL(ply.career_player_games, 0) AS career_player_games,
IFNULL(mgr.career_manager_games, 0) AS career_manager_games
FROM People ppl

LEFT JOIN (SELECT playerID, SUM(G_all) AS career_player_games FROM Appearances 
           GROUP BY playerID) ply 
ON ply.playerID = ppl.playerID

LEFT JOIN (SELECT playerID, SUM(G) AS career_manager_games FROM Managers 
           GROUP BY playerID) mgr 
ON mgr.playerID = ppl.playerID

LIMIT 100;

 * mysql+pymysql://root:***@localhost
100 rows affected.

[('aardsda01', 'Aardsma', 'David', Decimal('331'), Decimal('0')),
 ('aaronha01', 'Aaron', 'Hank', Decimal('3298'), Decimal('0')),
 ('aaronto01', 'Aaron', 'Tommie', Decimal('437'), Decimal('0')),
 ('aasedo01', 'Aase', 'Don', Decimal('448'), Decimal('0')),
 ('abadan01', 'Abad', 'Andy', Decimal('15'), Decimal('0')),
 ('abadfe01', 'Abad', 'Fernando', Decimal('400'), Decimal('0')),
 ('abadijo01', 'Abadie', 'John', Decimal('12'), Decimal('0')),
 ('abbated01', 'Abbaticchio', 'Ed', Decimal('857'), Decimal('0')),
 ('abbeybe01', 'Abbey', 'Bert', Decimal('79'), Decimal('0')),
 ('abbeych01', 'Abbey', 'Charlie', Decimal('452'), Decimal('0')),
 ('abbotco01', 'Abbott', 'Cory', Decimal('8'), Decimal('0')),
 ('abbotda01', 'Abbott', 'Dan', Decimal('3'), Decimal('0')),
 ('abbotfr01', 'Abbott', 'Fred', Decimal('160'), Decimal('0')),
 ('abbotgl01', 'Abbott', 'Glenn', Decimal('248'), Decimal('0')),
 ('abbotje01', 'Abbott', 'Jeff', Decimal('233'), Decimal('0')),
 ('abbotji01', 'Abbott', 'Jim', Decimal('263'), Decimal('0')),
 ('abbotku01', 'Abbott', 'Kurt', Decimal('702'), Decimal('0')),
 ('abbotky01', 'Abbott', 'Kyle', Decimal('57'), Decimal('0')),
 ('abbotod01', 'Abbott', 'Ody', Decimal('22'), Decimal('0')),
 ('abbotpa01', 'Abbott', 'Paul', Decimal('162'), Decimal('0')),
 ('aberal01', 'Aber', 'Al', Decimal('168'), Decimal('0')),
 ('abercda01', 'Abercrombie', 'Frank', Decimal('1'), Decimal('0')),
 ('abercre01', 'Abercrombie', 'Reggie', Decimal('180'), Decimal('0')),
 ('abernbi01', 'Abernathie', 'Bill', Decimal('1'), Decimal('0')),
 ('abernbr01', 'Abernathy', 'Brent', Decimal('232'), Decimal('0')),
 ('abernte01', 'Abernathy', 'Ted', Decimal('7'), Decimal('0')),
 ('abernte02', 'Abernathy', 'Ted', Decimal('681'), Decimal('0')),
 ('abernwo01', 'Abernathy', 'Woody', Decimal('16'), Decimal('0')),
 ('aberscl01', 'Aberson', 'Cliff', Decimal('63'), Decimal('0')),
 ('ablesha01', 'Ables', 'Harry', Decimal('14'), Decimal('0')),
 ('abnersh01', 'Abner', 'Shawn', Decimal('392'), Decimal('0')),
 ('abramca01', 'Abrams', 'Cal', Decimal('567'), Decimal('0')),
 ('abramge01', 'Abrams', 'George', Decimal('3'), Decimal('0')),
 ('abregjo01', 'Abrego', 'Johnny', Decimal('6'), Decimal('0')),
 ('abreual01', 'Abreu', 'Albert', Decimal('30'), Decimal('0')),
 ('abreubo01', 'Abreu', 'Bobby', Decimal('2425'), Decimal('0')),
 ('abreubr01', 'Abreu', 'Bryan', Decimal('42'), Decimal('0')),
 ('abreujo01', 'Abreu', 'Joe', Decimal('9'), Decimal('0')),
 ('abreujo02', 'Abreu', 'Jose', Decimal('1113'), Decimal('0')),
 ('abreuju01', 'Abreu', 'Juan', Decimal('7'), Decimal('0')),
 ('abreuto01', 'Abreu', 'Tony', Decimal('224'), Decimal('0')),
 ('abreuwi01', 'Abreu', 'Winston', Decimal('38'), Decimal('0')),
 ('abstebi01', 'Abstein', 'Bill', Decimal('170'), Decimal('0')),
 ('accarje01', 'Accardo', 'Jeremy', Decimal('262'), Decimal('0')),
 ('aceveal01', 'Aceves', 'Alfredo', Decimal('204'), Decimal('0')),
 ('acevedo01', 'Acevedo', 'Domingo', Decimal('10'), Decimal('0')),
 ('acevejo01', 'Acevedo', 'Jose', Decimal('104'), Decimal('0')),
 ('aceveju01', 'Acevedo', 'Juan', Decimal('367'), Decimal('0')),
 ('achteaj01', 'Achter', 'A. J.', Decimal('45'), Decimal('0')),
 ('ackerji01', 'Acker', 'Jim', Decimal('467'), Decimal('0')),
 ('ackerto01', 'Acker', 'Tom', Decimal('153'), Decimal('0')),
 ('ackledu01', 'Ackley', 'Dustin', Decimal('635'), Decimal('0')),
 ('acklefr01', 'Ackley', 'Fritz', Decimal('5'), Decimal('0')),
 ('acostcy01', 'Acosta', 'Cy', Decimal('107'), Decimal('0')),
 ('acosted01', 'Acosta', 'Ed', Decimal('57'), Decimal('0')),
 ('acostjo01', 'Acosta', 'Jose', Decimal('55'), Decimal('0')),
 ('acostma01', 'Acosta', 'Manny', Decimal('233'), Decimal('0')),
 ('acostme01', 'Acosta', 'Merito', Decimal('181'), Decimal('0')),
 ('acrema01', 'Acre', 'Mark', Decimal('114'), Decimal('0')),
 ('actama99', 'Acta', 'Manny', Decimal('0'), Decimal('890')),
 ('acunaro01', 'Acuna', 'Ronald', Decimal('395'), Decimal('0')),
 ('adairbi99', 'Adair', 'Bill', Decimal('0'), Decimal('10')),
 ('adairje01', 'Adair', 'Jerry', Decimal('1165'), Decimal('0')),
 ('adairji01', 'Adair', 'Jimmy', Decimal('18'), Decimal('0')),
 ('adamecr01', 'Adames', 'Cristhian', Decimal('176'), Decimal('0')),
 ('adamewi01', 'Adames', 'Willy', Decimal('431'), Decimal('0')),
 ('adamja01', 'Adam', 'Jason', Decimal('79'), Decimal('0')),
 ('adamsac01', 'Adams', 'Ace', Decimal('302'), Decimal('0')),
 ('adamsau01', 'Adams', 'Austin', Decimal('68'), Decimal('0')),
 ('adamsau02', 'Adams', 'Austin', Decimal('106'), Decimal('0')),
 ('adamsba01', 'Adams', 'Babe', Decimal('482'), Decimal('0')),
 ('adamsbe01', 'Adams', 'Bert', Decimal('267'), Decimal('0')),
 ('adamsbo01', 'Adams', 'Bob', Decimal('2'), Decimal('0')),
 ('adamsbo02', 'Adams', 'Bob', Decimal('5'), Decimal('0')),
 ('adamsbo03', 'Adams', 'Bobby', Decimal('1281'), Decimal('0')),
 ('adamsbo04', 'Adams', 'Bob', Decimal('15'), Decimal('0')),
 ('adamsbu01', 'Adams', 'Buster', Decimal('576'), Decimal('0')),
 ('adamsch01', 'Adams', 'Chance', Decimal('22'), Decimal('0')),
 ('adamsda01', 'Adams', 'Dan', Decimal('47'), Decimal('0')),
 ('adamsda02', 'Adams', 'David', Decimal('43'), Decimal('0')),
 ('adamsdi01', 'Adams', 'Dick', Decimal('37'), Decimal('0')),
 ('adamsdo01', 'Adams', 'Doug', Decimal('8'), Decimal('0')),
 ('adamsge01', 'Adams', 'George', Decimal('4'), Decimal('0')),
 ('adamsgl01', 'Adams', 'Glenn', Decimal('661'), Decimal('0')),
 ('adamshe01', 'Adams', 'Herb', Decimal('95'), Decimal('0')),
 ('adamsji01', 'Adams', 'Jim', Decimal('1'), Decimal('0')),
 ('adamsjo01', 'Adams', 'Joe', Decimal('1'), Decimal('0')),
 ('adamsjo02', 'Adamson', 'Joel', Decimal('44'), Decimal('0')),
 ('adamska01', 'Adams', 'Karl', Decimal('30'), Decimal('0')),
 ('adamsla01', 'Adams', 'Lane', Decimal('117'), Decimal('0')),
 ('adamsma01', 'Adams', 'Matt', Decimal('856'), Decimal('0')),
 ('adamsmi01', 'Adamson', 'Mike', Decimal('11'), Decimal('0')),
 ('adamsmi02', 'Adams', 'Mike', Decimal('100'), Decimal('0')),
 ('adamsmi03', 'Adams', 'Mike', Decimal('409'), Decimal('0')),
 ('adamsre01', 'Adams', 'Red', Decimal('8'), Decimal('0')),
 ('adamsri01', 'Adams', 'Rick', Decimal('12'), Decimal('0')),
 ('adamsri02', 'Adams', 'Ricky', Decimal('120'), Decimal('0')),
 ('adamsri03', 'Adams', 'Riley', Decimal('47'), Decimal('0')),
 ('adamsru01', 'Adams', 'Russ', Decimal('286'), Decimal('0')),
 ('adamsry01', 'Adams', 'Ryan', Decimal('29'), Decimal('0'))]

In [97]:
%%sql
# Test my query with players born in California with nameLast "Williams."

SELECT ppl.playerID, ppl.nameLast, ppl.nameFirst,
IFNULL(ply.career_player_games, 0) AS career_player_games,
IFNULL(mgr.career_manager_games, 0) AS career_manager_games
FROM People ppl

LEFT JOIN (SELECT playerID, SUM(G_all) AS career_player_games FROM Appearances 
           GROUP BY playerID) ply 
ON ply.playerID = ppl.playerID

LEFT JOIN (SELECT playerID, SUM(G) AS career_manager_games FROM Managers 
           GROUP BY playerID) mgr 
ON mgr.playerID = ppl.playerID

WHERE ppl.birthState = 'CA' AND ppl.nameLast = 'Williams';

 * mysql+pymysql://root:***@localhost
11 rows affected.

[('willibe01', 'Williams', 'Bernie', Decimal('102'), Decimal('0')),
 ('willido02', 'Williams', 'Don', Decimal('3'), Decimal('0')),
 ('williji03', 'Williams', 'Jimy', Decimal('14'), Decimal('1700')),
 ('willike02', 'Williams', 'Ken', Decimal('451'), Decimal('0')),
 ('willima04', 'Williams', 'Matt', Decimal('1866'), Decimal('324')),
 ('willimi02', 'Williams', 'Mitch', Decimal('619'), Decimal('0')),
 ('williri02', 'Williams', 'Rinaldo', Decimal('4'), Decimal('0')),
 ('williri03', 'Williams', 'Rick', Decimal('48'), Decimal('0')),
 ('willish01', 'Williams', 'Shad', Decimal('14'), Decimal('0')),
 ('willite01', 'Williams', 'Ted', Decimal('2292'), Decimal('637')),
 ('willitr01', 'Williams', 'Trevor', Decimal('129'), Decimal('0'))]